In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv(r'D:\天池训练赛\训练\tianchi_fresh_comp_train_user.csv')
print(df.head())

    user_id    item_id  behavior_type user_geohash  item_category  \
0  10001082  285259775              1      97lk14c           4076
1  10001082    4368907              1          NaN           5503
2  10001082    4368907              1          NaN           5503
3  10001082   53616768              1          NaN           9762
4  10001082  151466952              1          NaN           5232

            time
0  2014-12-08 18
1  2014-12-12 12
2  2014-12-12 12
3  2014-12-02 15
4  2014-12-12 11

In [3]:
print(df.isnull().sum())

user_id                 0
item_id                 0
behavior_type           0
user_geohash     15911010
item_category           0
time                    0
dtype: int64

In [4]:
df = df.drop('user_geohash',axis=1)

In [5]:
print(df.isnull().sum())

user_id          0
item_id          0
behavior_type    0
item_category    0
time             0
dtype: int64

In [6]:
#查看数据类型
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23291027 entries, 0 to 23291026
Data columns (total 5 columns):
 #   Column         Dtype
---  ------         -----
 0   user_id        int64
 1   item_id        int64
 2   behavior_type  int64
 3   item_category  int64
 4   time           object
dtypes: int64(4), object(1)
memory usage: 888.5+ MB

In [7]:
#读取重复值有哪些
df.duplicated(keep=False)

0           False
1            True
2            True
3            True
4            True
            ...
23291022     True
23291023    False
23291024     True
23291025     True
23291026     True
Length: 23291027, dtype: bool

In [8]:
df[df.duplicated(keep=False)]

           user_id    item_id  behavior_type  item_category           time
1         10001082    4368907              1           5503  2014-12-12 12
2         10001082    4368907              1           5503  2014-12-12 12
3         10001082   53616768              1           9762  2014-12-02 15
4         10001082  151466952              1           5232  2014-12-12 11
6         10001082  290088061              1           5503  2014-12-12 12
...            ...        ...            ...            ...            ...
23291021  65341491  312926385              1           9412  2014-11-29 10
23291022  65341491  259008790              1          13164  2014-12-03 12
23291024  65341491   52142024              1           5201  2014-12-10 22
23291025  65341491  250557965              1          13164  2014-12-03 12
23291026  65341491  300315408              1           1838  2014-11-29 08

[18808892 rows x 5 columns]

In [10]:
df.drop_duplicates(keep="first",inplace=True)

In [11]:
df

           user_id    item_id  behavior_type  item_category           time
0         10001082  285259775              1           4076  2014-12-08 18
1         10001082    4368907              1           5503  2014-12-12 12
3         10001082   53616768              1           9762  2014-12-02 15
4         10001082  151466952              1           5232  2014-12-12 11
5         10001082   53616768              4           9762  2014-12-02 15
...            ...        ...            ...            ...            ...
23291006  65341491  309130576              1          11721  2014-12-11 07
23291008  65341491  242501625              1           3942  2014-12-08 19
23291009  65341491  119296766              1           1797  2014-11-18 12
23291015  65341491  155217475              2           3093  2014-12-18 01
23291023  65341491  336404938              1          13164  2014-12-03 12

[11785920 rows x 5 columns]

In [12]:
df.duplicated(keep=False)

0           False
1           False
3           False
4           False
5           False
            ...
23291006    False
23291008    False
23291009    False
23291015    False
23291023    False
Length: 11785920, dtype: bool

In [13]:
df[df.duplicated(keep=False)]

Empty DataFrame
Columns: [user_id, item_id, behavior_type, item_category, time]
Index: []